КСиС/лаба5/myartifact/src/main/resources/user-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://www.example.org/SoapService"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header/>
    <soapenv:Body>
        <us:getUserRequest>
            <us:name>Sam</us:name>
        </us:getUserRequest>
    </soapenv:Body>
</soapenv:Envelope>